In [1]:
import numpy as np

# IMPORTING OF PANDAS

**NOTE :**
1. SHIFT + TAB : ITS USED TO GET DESCRIPTION OF PARTCULAR FUNCTION

In [2]:
import pandas as pd

#### 1.CREATING A DATAFRAME

In [3]:
#creating of data frame(df):
df = pd.DataFrame(([1,2,3],[4,5,6],[7,8,9],[10,11,12],[13,14,15],[16,17,18]))
print(df)
print()

#df.head(n): it will print 1st n value from df
#default value of n==5
print(df.head(3))
print()

#df.tail(n): it'll print last n value from df
#default value of n==5
print(df.tail(3))

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

    0   1   2
3  10  11  12
4  13  14  15
5  16  17  18

#### 2.ADDING COLUMN_NAME/ COLUMN_LABEL

In [4]:
#creating of data frame(df):
#syntax: pd.DataFrame(list)
df2 = pd.DataFrame(np.arange(1,16).reshape(5,3))
print(df2*10)
print()

#adding column heading:
#syntax: pd.DataFrame(list,columns=[column_name_list])
df1 = pd.DataFrame(np.arange(1,16).reshape(5,3),columns=["A",'B','C'])
print(df1)
print()

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120
4  130  140  150

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

**NOTE:**

1. EXPLICIT INDEX: THE INDEX WHICH ARE VISIBLE & WE CAN ACCESS IT BY USING THEM.(eg. column_label {'A','B','C'},row_label{0,1,2,3,4}



2. IMPLICIT INDEX : THE INDEX WHICH ARE NOT VISIBLE BUT THEN TO WE CAN ACCESS THEM BY THEIR POSITION.(eg. in python list,tuple,string,etc.. we can access using index number ranges from '0-N' )

#### 3.SHAPE OF DATAFRAME

In [5]:
#DF_NAME.SHAPE(): it will return a tuple with shapes/dimension of data_table
df1.shape

(5, 3)

#### 4.ILOC()

In [6]:
print(df2)
print()

#DF_NAME.ILOC(ROW_NO,COL_NO):ITS USED TO ACCESS USING INDEX NO
#accesing value = 11 in df1
print('ACCESSING 11:  ',df2.iloc[3,1])

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

ACCESSING 11:   11

#### 5.CONCATINATION

In [7]:
A1 = pd.DataFrame({'A':[10,11,12],'B':[12,13,14]})
A2 = pd.DataFrame({'A':[10,11,12],'D':[12,13,14]})
print(A1,A2,sep='\n\n')
print()

#pd.concate(df's):it will concatinate the two or more df along the mention axis
#bydefault axis=0
A_default = pd.concat((A1,A2))
print(A_default)
print()

#concatination along axis=0
A_axis0 = pd.concat((A1,A2),axis=0)
print(A_axis0)
print()

#concatination along axis=1
A_axis1 = pd.concat((A1,A2),axis=1)
print(A_axis1)
print()

#modified key concatination
A_modified = pd.concat((A1,A2),keys={'a','b'})
print(A_modified)

    A   B
0  10  12
1  11  13
2  12  14

    A   D
0  10  12
1  11  13
2  12  14

    A     B     D
0  10  12.0   NaN
1  11  13.0   NaN
2  12  14.0   NaN
0  10   NaN  12.0
1  11   NaN  13.0
2  12   NaN  14.0

    A     B     D
0  10  12.0   NaN
1  11  13.0   NaN
2  12  14.0   NaN
0  10   NaN  12.0
1  11   NaN  13.0
2  12   NaN  14.0

    A   B   A   D
0  10  12  10  12
1  11  13  11  13
2  12  14  12  14

      A     B     D
b 0  10  12.0   NaN
  1  11  13.0   NaN
  2  12  14.0   NaN
a 0  10   NaN  12.0
  1  11   NaN  13.0
  2  12   NaN  14.0

#### 6.INNER JOIN VS OUTER JOIN

In [8]:
print(A1,A2,sep='\n\n')
print()

#INNERJOIN or INNERCONCATINATION:it will join such that it will return intersection of two df on a given axis
A_INNER_JT = pd.concat([A1,A2],axis=0,join='inner')
print(A_INNER_JT)
print()

#OUTERJOIN or OUTERCONCATINATION:it will join such that it will return JOINING of two df along mention axis
A_INNER_JT = pd.concat([A1,A2],axis=0,join='outer')
print(A_INNER_JT)
print()

    A   B
0  10  12
1  11  13
2  12  14

    A   D
0  10  12
1  11  13
2  12  14

    A
0  10
1  11
2  12
0  10
1  11
2  12

    A     B     D
0  10  12.0   NaN
1  11  13.0   NaN
2  12  14.0   NaN
0  10   NaN  12.0
1  11   NaN  13.0
2  12   NaN  14.0

# WORKING WITH CSV FILE

#### 1.READING OF CSV FILE

In [9]:
#pd.read_csv('filename.csv'):loading of csv_file in pandas
df = pd.read_csv('Medals.csv')
df

    Rank        Country  Gold  Silver  Bronze  Total
0      1  United States    39      41      33    113
1      2          China    38      32      18     88
2      3          Japan    27      14      17     58
3      4  Great Britain    22      21      22     65
4      5            ROC    20      28      23     71
..   ...            ...   ...     ...     ...    ...
88    86          Ghana     0       0       1      1
89    86        Grenada     0       0       1      1
90    86         Kuwait     0       0       1      1
91    86        Moldova     0       0       1      1
92    86          Syria     0       0       1      1

[93 rows x 6 columns]

#### 2.TYPE OF DATA-FRAME

In [10]:
# type of a given dataframe df
print(type(df))

<class 'pandas.core.frame.DataFrame'>

#### 3.ACCESSING VALUE IN DATA FRAME

In [11]:
#its a specialize dictionary in which we can access any column
#we can access multiple value in table
#to access multiple value we have to pass a list of column name
print(df[['Country','Rank']])
print()

#df.column_name : we can also access req column name like this also
#avoid this method as there may be a chance that your con name clashes with panda builtin funcn
print(df.Country)
print()

print(df.Country is df['Country'])

          Country  Rank
0   United States     1
1           China     2
2           Japan     3
3   Great Britain     4
4             ROC     5
..            ...   ...
88          Ghana    86
89        Grenada    86
90         Kuwait    86
91        Moldova    86
92          Syria    86

[93 rows x 2 columns]

0     United States
1             China
2             Japan
3     Great Britain
4               ROC
          ...
88            Ghana
89          Grenada
90           Kuwait
91          Moldova
92            Syria
Name: Country, Length: 93, dtype: object

True

#### 4. SERIES & DATA-FRAME DIFFERENCE

In [12]:
#'pandas.core.series.Series': 1-d is generally refered as series
#'pandas.core.frame.DataFrame' : more than 1_d is refered as Data_Frame or matrix
a = df['Rank']
b = df[['Gold','Silver','Bronze']]
print(type(a),type(b),sep='\n')

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

#### 5.PRINTING 1ST 'N' LINES USING HEAD()

In [13]:
#df.head(n) : printing the required first 'n' value
#by default n == 5
df.head(10)

   Rank        Country  Gold  Silver  Bronze  Total
0     1  United States    39      41      33    113
1     2          China    38      32      18     88
2     3          Japan    27      14      17     58
3     4  Great Britain    22      21      22     65
4     5            ROC    20      28      23     71
5     6      Australia    17       7      22     46
6     7    Netherlands    10      12      14     36
7     8         France    10      12      11     33
8     9        Germany    10      11      16     37
9    10          Italy    10      10      20     40

#### 6.PRINTING LAST 'N' LINES USING TAIL()

In [14]:
#df.tail(n) : printing the required last 'n' value
#by default n == 5
df.tail(10)

    Rank        Country  Gold  Silver  Bronze  Total
83    84         Mexico     0       0       4      4
84    85        Finland     0       0       2      2
85    86       Botswana     0       0       1      1
86    86   Burkina Faso     0       0       1      1
87    86  Côte d'Ivoire     0       0       1      1
88    86          Ghana     0       0       1      1
89    86        Grenada     0       0       1      1
90    86         Kuwait     0       0       1      1
91    86        Moldova     0       0       1      1
92    86          Syria     0       0       1      1

#### 7.PRINTING SHORT INFORMATION ABOUT DATA

In [15]:
#df.info() : it will provide short information about the data_frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     93 non-null     int64
 1   Country  93 non-null     object
 2   Gold     93 non-null     int64
 3   Silver   93 non-null     int64
 4   Bronze   93 non-null     int64
 5   Total    93 non-null     int64
dtypes: int64(5), object(1)
memory usage: 4.5+ KB

**Notes:**
1. if data-type is unable to recognized its return as object
2. if there is missing value than non-null will be changed to null
3. RangeIndex: 93 entries, 0 to 92: it tells about no of rows in data-frame

#### 8.STATISTICAL DISCRIPTION OF DATA

In [16]:
#df.describe() : it will give the numerical/statistical summary of your data-frame
df.describe()

            Rank       Gold     Silver     Bronze       Total
count  93.000000  93.000000  93.000000  93.000000   93.000000
mean   46.333333   3.655914   3.634409   4.322581   11.612903
std    26.219116   7.022471   6.626339   6.210372   19.091332
min     1.000000   0.000000   0.000000   0.000000    1.000000
25%    24.000000   0.000000   0.000000   1.000000    2.000000
50%    46.000000   1.000000   1.000000   2.000000    4.000000
75%    70.000000   3.000000   4.000000   5.000000   11.000000
max    86.000000  39.000000  41.000000  33.000000  113.000000

#### 9.DESCRIPTION OR INFO ABOUT OBJECT TYPE DATA-TYPES

In [17]:
df.describe(include = 'object')

              Country
count              93
unique             93
top     United States
freq                1

#### 10.CHANGING ROW INDEX NAME TO NEW INDEX

In [18]:
#original df has row index as no 0,1,2,3,.... before
print(df)
print()

#df.set_index('column_name_to_be_used_as_indexed'): it will convert the row index as a mention column name
#after applying this our df will look like as shown below
a = df.set_index('Country')
print(a)

    Rank        Country  Gold  Silver  Bronze  Total
0      1  United States    39      41      33    113
1      2          China    38      32      18     88
2      3          Japan    27      14      17     58
3      4  Great Britain    22      21      22     65
4      5            ROC    20      28      23     71
..   ...            ...   ...     ...     ...    ...
88    86          Ghana     0       0       1      1
89    86        Grenada     0       0       1      1
90    86         Kuwait     0       0       1      1
91    86        Moldova     0       0       1      1
92    86          Syria     0       0       1      1

[93 rows x 6 columns]

               Rank  Gold  Silver  Bronze  Total
Country
United States     1    39      41      33    113
China             2    38      32      18     88
Japan             3    27      14      17     58
Great Britain     4    22      21      22     65
ROC               5    20      28      23     71
...             ...   ...     ...     ...    ...
Ghana            86     0       0       1      1
Grenada          86     0       0       1      1
Kuwait           86     0       0       1      1
Moldova          86     0       0       1      1
Syria            86     0       0       1      1

[93 rows x 5 columns]

**NOTE:**
1. WE CAN NOW ACCESS THE REQUIRED VALUE USING THE NEW SET INDEXED VALUES

2. WE CAN ALSO ACCESS VALUE USING INDEXED NO TO ORIGINAL DATA FRAME ALSO

**refer below eg to get things clear**

In [27]:
# '10' as Ranks is starting from one(1)
print(a.iloc[10])
print()

# # '9' as Ranks is starting from zero(0)
print(df['Country'][10])

Rank      11
Gold       7
Silver     6
Bronze    11
Total     24
Name: Canada, dtype: int64

Canada

#### 11.ACCESSING ALL THE COLUMN NAMES HEADING

In [ ]:
#df.columns : it will give the list of all the column name in our original data-frame df
print(df.columns)
print()

#df.keys() : it can also be used to access all the column name
print(df.keys())

#### 12.DROPPING A PARTICULAR COLUMN FROM DATA-FRAME

In [ ]:
#df.drop('col_name',axis=k,inplace=True/False): this will drop a particular col mentioned. the axis of col/row should be mention
#the inplace parameter will decide whether we have to delete from our og data frame if inplace= true
df.drop('Total',axis=1)

# WHY USE OF df.iloc() & df.loc()

In [ ]:
data = pd.Series(['a1','a2','a3','a4','a5'],index=[5,4,3,2,1])
print(data)
print()

#here implicit index/position index is 0,1,2,3,4
#explicit index is 5,4,3,2,1

#note1: when we index a particular value it uses explicit index as shown below
print('Get a3 : ',data[3],sep='\n')
print()

#note2: when we want to slice a particular values it uses position instead of explicit index.
print('Get a2, a3, a4 : ',data[1:4],sep='\n')
print()

#since ther will be confusion that which to use when.
#therefor, loc(explicit) & iloc(implicit /positional indexing) was created
print('Get a2 using iloc() : ',data.iloc[1],sep='\n')
print()
print('Get a2 using loc() : ',data.loc[4],sep='\n')

**Note :**

LOC : labels or explicit index

ILOC : positional or implicit indexing

#### 13.USE OF ILOC()

In [ ]:
a

In [ ]:
#df.iloc(): it will access a particular element using positon
#suppose we want to access "Total of 88 medals"
print("Total of '88' medals",a.iloc[1][4],sep='\n')
print()

#slicing using iloc :-- suppose we want to access "Total of 88,58,65,71 medals"
#while using iloc, use df.iloc[row:range, col:range] convention
print("Total of 88,58,65,71 medals using iloc() : ",a.iloc[1:5,4],sep='\n' )

#### 14.USE OF LOC()

In [ ]:
# loc will include 'loc(start,end)' end value also
#df.loc(): it will access a particular element using index which are given
#suppose we want to access "Total of 88 medals"
print("Total of 88 medals",a.loc['China'][4],sep='\n')
print()

#slicing using loc :-- suppose we want to access "Total of 88,58,65,71 medals"
#while using loc, use df.loc[row:range, col:range] convention
print("Total of 88,58,65,71 medals using loc() : ",a.loc['China':'ROC']['Total'],sep='\n' )

#### 15.GETTING COLUMN HEADINGS OR KEYS

In [ ]:
#DF.KEYS() OR DF.COLUMNS() : both work similar & will return all the column name or keys.
print('using df.keys : ',df.keys(),sep='\n\t')
print('~'*50)
print('using df.columns : ',df.columns,sep='\n\t')

#### 16.GETTING VALUES TO BE PRINTED

In [ ]:
#DF.VALUES() : it'll return array of all the values in a data frame
#it will return homogenous type of data-type called object althouh all the individual values may be heterogenous
print(df.values,sep=',',end=',')

#### 17.ACCESSING SPECIFIC MULTIPLE ROWS OF DATA-FRAME

In [ ]:
#suppose we want to access china,syria,kuwait entir rows
print(a)
print()

#using loc():
print('#using loc(): ',a.loc[['China','Kuwait','Syria']],sep='\n')
print()

#using iloc():
print('#using iloc(): ',a.iloc[[2,90,92]],sep='\n')

**Note:**

1. Note we can access using negative index using i loc as we used to access in python

2. negative indexing may not work in iloc as there are chances that column has no -ve value to be access as index

#### 18.GETTING A CONDITIONAL BASED BOOLEAN COLUMN

In [ ]:
#suppose we want to access 'total no of medal >= 50'   for all the country
df['Total'] >= 50

#### 19.USING ABOVE CONDn AND FILTERING VALUES ON CONDn BASIS

In [ ]:
print(df[df['Total'] >= 50])
print()
print(df.loc[df['Total'] >= 50])
print()

#Note: df.iloc[df['Total'] >= 50] : it won't work as we are using iloc
#its better to use loc for filtering out the required condition

#### 20.USING MULTIPLE CONDn AND FILTERING VALUES ON CONDn BASIS

In [ ]:
# IF WE WANT TO GET COUNTRY WITH GOLD > 30 & tOTAL > 50
print(df.loc[(df['Total'] >= 50) & (df["Gold"] >= 30)])
print()

# IF WE WANT TO GET COUNTRY WITH 20 < BRONZE < 50 &  30 < Silver < 50
print(df.loc[((df['Silver'] < 50) & (df['Silver'] > 30)) & ((df['Bronze']) < 50) & ((df['Bronze']) > 20)])

#### 21.USING CONDn AND APPLYING STATISTICS ON CONDn BASIS

In [ ]:
# IF WE WANT TO GET COUNTRY WITH GOLD > 30 & tOTAL > 50 AND ALSO AVERAGE OF THE TOTAL MEDALS OF THAT COUNTRY
k1 = df[(df['Total'] >= 50) & (df["Gold"] >= 30)]
print(k1)
print()

print(np.average(k1['Total']))
print()

print(df.loc[(df['Total'] >= 50) & (df["Gold"] >= 30),"Total"])
print()

print(df.loc[(df['Total'] >= 50) & (df["Gold"] >= 30),"Total"].mean())